In [8]:
#Write code statements to list the following, from a dataframe namely 'SALES'
#a) List only columns ITEM and REVENUE
#b) List rows from 3 to 7
#c) List the value of cell in 5th row, ITEM column
import pandas as pd 
i=['mobile','notebooks','pens','keyboard','laptop','cameras','pen drives','ext hdd']
r=[1000000, 20000000,50000, 4000000,30000000,50000, 6000000,70002312]
s={'items':i, 'revenue':r}
sales=pd.DataFrame(s)
print(sales[['items','revenue']])
print(sales.loc[0,'revenue'])
print(sales.loc[0]['revenue'])
print(sales.at[1,'items'])
print(sales.iat[1,1])

items   revenue
0      mobile   1000000
1   notebooks  20000000
2        pens     50000
3    keyboard   4000000
4      laptop  30000000
5     cameras     50000
6  pen drives   6000000
7     ext hdd  70002312
1000000
1000000
notebooks
20000000

In [16]:
sales.head(2)

       items   revenue
0     mobile   1000000
1  notebooks  20000000

In [15]:
sales.tail(2)

        items   revenue
6  pen drives   6000000
7     ext hdd  70002312

In [25]:
sales[3:8]

        items   revenue
3    keyboard   4000000
4      laptop  30000000
5     cameras     50000
6  pen drives   6000000
7     ext hdd  70002312

In [26]:
sales[5:6]

     items  revenue
5  cameras    50000

In [33]:
import numpy as np
import pandas as pd  
sales['C']=np.NaN
sales

        items   revenue   C
0      mobile   1000000 NaN
1   notebooks  20000000 NaN
2        pens     50000 NaN
3    keyboard   4000000 NaN
4      laptop  30000000 NaN
5     cameras     50000 NaN
6  pen drives   6000000 NaN
7     ext hdd  70002312 NaN

In [41]:
sales.drop('C',axis=1)

        items   revenue
0      mobile   1000000
1   notebooks  20000000
2        pens     50000
3    keyboard   4000000
4      laptop  30000000
5     cameras     50000
6  pen drives   6000000
7     ext hdd  70002312

In [49]:
#sales.drop('C',axis=1)
sales

        items   revenue
0      mobile   1000000
1   notebooks  20000000
2        pens     50000
3    keyboard   4000000
4      laptop  30000000
5     cameras     50000
6  pen drives   6000000
7     ext hdd  70002312

In [2]:
import numpy as np 
import pandas as pd 
i=['pen','pencil','stapller','fevicol','notebook','register','geometry set','eraser','ink','refills']
q=[10,100,20, 25,100,200,5,20,10,100]
p=[10,5,25,10,50,100,150,15,40,2]
d={'item':i,'qty':q,'price':p }
df=pd.DataFrame(d)
df

           item  qty  price
0           pen   10     10
1        pencil  100      5
2      stapller   20     25
3       fevicol   25     10
4      notebook  100     50
5      register  200    100
6  geometry set    5    150
7        eraser   20     15
8           ink   10     40
9       refills  100      2

In [6]:
df['val']=np.NaN
df['val']=100
df

           item  qty  price  val
0           pen   10     10  100
1        pencil  100      5  100
2      stapller   20     25  100
3       fevicol   25     10  100
4      notebook  100     50  100
5      register  200    100  100
6  geometry set    5    150  100
7        eraser   20     15  100
8           ink   10     40  100
9       refills  100      2  100

In [ ]:
#September 18, 2020 Revision
#Q1: create a data frame containg name and marks in three subjects, for 5 students
#Q2: create 4 sequences of each column of data frame
#Q3: Display Highest Marks in each from from data frame

In [2]:
import pandas as pd 
import numpy as np 
table=pd.Series(np.arange(5,50,5))
print(table)

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
dtype: int64

In [1]:
import pandas as pd 
stu={'a':45, 'b':50,'c':41,'d':51}
print(stu)
ser=pd.Series(stu)
print(ser)

{'a': 45, 'b': 50, 'c': 41, 'd': 51}
a    45
b    50
c    41
d    51
dtype: int64
50

In [3]:
import pandas as pd 
stu={'a':45, 'b':50,'c':41,'d':51}
ser=pd.Series(stu)
for i in ser:
    print(i, end=" ")

45 50 41 51

In [6]:
import pandas as pd
c1=pd.Series([10,20,30],['maths','science','ip'])
c2=pd.Series([40,15,25],['maths','science','ip'])
print(c1)
print(c2)
print(c1*c2)

maths      10
science    20
ip         30
dtype: int64
maths      40
science    15
ip         25
dtype: int64
maths      400
science    300
ip         750
dtype: int64